#### BuiltInFailures.DirectShapeFailures Members

---

|  |
| --- |
| BuiltInFailures DirectShapeFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures DirectShapeFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCreateDirectShapeOrTypeDocumentCorruption | Cannot create a DirectShape or DirectShapeType. |
| Public property Static member | CannotCreateDirectShapeOrTypeError | Cannot create a DirectShape or DirectShapeType. |
| Public property Static member | CannotCreateDirectShapeOrTypeWarning | Cannot create a DirectShape or DirectShapeType. |
| Public property Static member | CannotCreateDirectShapeRefsWarning | Cannot create reference objects for a DirectShape. |
| Public property Static member | CannotCreateDirectShapeTypeRefsWarning | Cannot create reference objects for a DirectShapeType. |

# See Also

BuiltInFailures DirectShapeFailures Class

Autodesk.Revit.DB Namespace